In [1]:
import pandas as pd
from pandasql import sqldf
import numpy as np
import datetime as dt

In [4]:
q = """WITH split(value, str) AS (
SELECT '', '174.0,103.0,77.0,42.0,54.0,81.0,140.0,235.0,438.0,557.0'||','
UNION ALL SELECT
substr(str, 0, coalesce(instr(str, ','), length(str))),
substr(str, instr(str, ',')+1)
FROM split WHERE str!=''
) SELECT row_number () OVER () key,
         value FROM split WHERE value!='';"""

In [5]:
sqldf(q)

   key  value
0    1  174.0
1    2  103.0
2    3   77.0
3    4   42.0
4    5   54.0
5    6   81.0
6    7  140.0
7    8  235.0
8    9  438.0
9   10  557.0